// Справочник инцидентов 
export const TKO_INCIDENTS = [
  "Нарушение графика вывоза ТКО",
  "Несанкционированная свалка",
  "Переполнение контейнерной площадки",
  "Ошибка в начислениях / Квитанция",
  "Повреждение бакового парка",
];

//Параметры СЭД
export const SERVICE_FIELDS = [
  {
    name: "sourceChannel",
    label: "Канал поступления",
    type: "select",
    options: [
      "РЭО Радар",
      "ЕПГУ (Госуслуги)",
      "Приемная ППК РЭО",
      "Система СЭД-Тэсса",
    ],
  },
  {
    name: "incidentType",
    label: "Тип инцидента ТКО",
    type: "select",
    options: TKO_INCIDENTS,
  },
  {
    name: "urgencyLevel",
    label: "Приоритет обработки",
    type: "select",
    options: [
      "Низкий",
      "Регламентный (Стандарт)",
      "Высокий (Критичный)",
      "Экстренный ГД",
    ],
  },
  {
    name: "regionCode",
    label: "Субъект РФ",
    type: "select",
    options: [
      "77 (г. Москва)",
      "50 (Московская область)",
      "78 (г. Санкт-Петербург)",
      "23 (Краснодарский край)",
      "54 (Новосибирская область)",
    ],
  },
  { name: "controlTerm", label: "Контрольный срок ответа", type: "text" },
  {
    name: "resolutionType",
    label: "Форма закрытия инцидента",
    type: "select",
    options: [
      "Разъяснение",
      "Устранено регоператором",
      "Перенаправлено в Минприроды",
      "Отказ",
    ],
  },
];

//Профиль заявителя
export const CITIZEN_SERVICE_FIELDS = [
  {
    name: "citizenType",
    label: "Категория заявителя",
    type: "select",
    options: [
      "Физическое лицо (Гражданин)",
      "Юридическое лицо (Бизнес)",
      "Индивидуальный предприниматель",
      "Общественная организация",
    ],
  },
  {
    name: "regOperator",
    label: "Целевой региональный оператор",
    type: "select",
    options: [
      "ООО ЭкоЛайн",
      "ПКГУ Мосэкопром",
      "Хартия ТКО",
      "РТ-Инвест",
      "Региональный оператор Восток",
    ],
  },
  {
    name: "loyaltyLevel",
    label: "Индекс лояльности (СЭД)",
    type: "select",
    options: [
      "Стандартный",
      "Повторные жалобы",
      "Конфликтный",
      "Судебное разбирательство",
    ],
  },
];
